espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/driver/mvp/inc/sl_mvp.h
/***************************************************************************//**
 * @file
 * @brief MVP Core driver.
 *******************************************************************************
 * # License
 * <b>Copyright 2021 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/
#ifndef SL_MVP_H
#define SL_MVP_H

#include "sl_status.h"
#include "em_device.h"
#include "sl_mvp_types.h"

#ifdef __cplusplus
extern "C" {
#endif

/// @cond DO_NOT_INCLUDE_WITH_DOXYGEN
/***************************************************************************//**
 * @addtogroup mvp MVP API
 * @{
 ******************************************************************************/

// Defines for each of the 8 MVP registers.
#define SLI_MVP_R0 0
#define SLI_MVP_R1 1
#define SLI_MVP_R2 2
#define SLI_MVP_R3 3
#define SLI_MVP_R4 4
#define SLI_MVP_R5 5
#define SLI_MVP_R6 6
#define SLI_MVP_R7 7

// Defines for Loop/Stream increments.
#define SLI_MVP_NOINCR   0x0
#define SLI_MVP_INCRDIM0 0x1
#define SLI_MVP_INCRDIM1 0x2
#define SLI_MVP_INCRDIM2 0x4
#define SLI_MVP_INCRDIM_VEC SLI_MVP_INCRDIM0
#define SLI_MVP_INCRDIM_ROW SLI_MVP_INCRDIM1
#define SLI_MVP_INCRDIM_COL SLI_MVP_INCRDIM2

// Alternative INCRDIM macros, useful when using "NHWC" tensors.
#define SLI_MVP_INCRDIM_DEPTH   SLI_MVP_INCRDIM_VEC
#define SLI_MVP_INCRDIM_HEIGHT  SLI_MVP_INCRDIM_ROW
#define SLI_MVP_INCRDIM_WIDTH   SLI_MVP_INCRDIM_COL

// Defines for Loop dimension resets.
#define SLI_MVP_NO_DIM_RESET  0x0
#define SLI_MVP_RESETDIM0 0x1
#define SLI_MVP_RESETDIM1 0x2
#define SLI_MVP_RESETDIM2 0x4
#define SLI_MVP_RESETDIM_VEC SLI_MVP_RESETDIM0
#define SLI_MVP_RESETDIM_ROW SLI_MVP_RESETDIM1
#define SLI_MVP_RESETDIM_COL SLI_MVP_RESETDIM2

// Alternative RESETDIM macros, useful when using "NHWC" tensors.
#define SLI_MVP_RESETDIM_DEPTH  SLI_MVP_RESETDIM_VEC
#define SLI_MVP_RESETDIM_HEIGHT SLI_MVP_RESETDIM_ROW
#define SLI_MVP_RESETDIM_WIDTH  SLI_MVP_RESETDIM_COL

// Defines for Instruction RegLoad/RegStore selection (for STREAM macro).
#define SLI_MVP_REGLOAD0 0
#define SLI_MVP_REGLOAD1 1
#define SLI_MVP_REGSTORE 2

// Defines for ALUIN macro.
#define SLI_MVP_ALUIN0  0
#define SLI_MVP_ALUIN1  1
#define SLI_MVP_ALUIN2  2
#define SLI_MVP_ENDPROG 1
#define SLI_MVP_NONE    0

// Defines for ALU register modifiers.
#define SLI_MVP_ALUIN_REALZERO   0x1
#define SLI_MVP_ALUIN_REALNEGATE 0x2
#define SLI_MVP_ALUIN_IMAGZERO   0x4
#define SLI_MVP_ALUIN_IMAGNEGATE 0x8

// MVP hardware limits.
#define SLI_MVP_MAX_DIM            (3U)
#define SLI_MVP_MAX_VECTOR_COUNT   ((_MVP_ARRAYDIM0CFG_SIZE_MASK >> _MVP_ARRAYDIM0CFG_SIZE_SHIFT)+ 1U)
#define SLI_MVP_MAX_ROW_LENGTH     ((_MVP_ARRAYDIM1CFG_SIZE_MASK >> _MVP_ARRAYDIM1CFG_SIZE_SHIFT)+ 1U)
#define SLI_MVP_MAX_COLUMN_LENGTH  ((_MVP_ARRAYDIM2CFG_SIZE_MASK >> _MVP_ARRAYDIM2CFG_SIZE_SHIFT)+ 1U)
#define SLI_MVP_MAX_VECTOR_STRIDE  ((_MVP_ARRAYDIM0CFG_STRIDE_MASK >> (_MVP_ARRAYDIM0CFG_STRIDE_SHIFT+1)))
#define SLI_MVP_MIN_VECTOR_STRIDE  (-MAX_VECTOR_STRIDE - 1)
#define SLI_MVP_MAX_ROW_STRIDE     ((_MVP_ARRAYDIM1CFG_STRIDE_MASK >> (_MVP_ARRAYDIM1CFG_STRIDE_SHIFT+1)))
#define SLI_MVP_MIN_ROW_STRIDE     (-MAX_ROW_STRIDE - 1)
#define SLI_MVP_MAX_COLUMN_STRIDE  ((_MVP_ARRAYDIM2CFG_STRIDE_MASK >> (_MVP_ARRAYDIM2CFG_STRIDE_SHIFT+1)))
#define SLI_MVP_MIN_COLUMN_STRIDE  (-MAX_COLUMN_STRIDE - 1)

#define SLI_MVP_FP16_MIN               (-65504.0f)
#define SLI_MVP_FP16_MAX               65504.0f
#define SLI_MVP_ACCUMULATOR_MULTIPLIER (1 << 15)
#define SLI_MVP_ACCUMULATOR_SCALER     (1.0f / SLI_MVP_ACCUMULATOR_MULTIPLIER)

// Array id macro for readability.
#define SLI_MVP_ARRAY(n) (n)

// Loop id macro for readability.
#define SLI_MVP_LOOP(n) (n)

// Instruction id macro for readability.
#define SLI_MVP_INSTR(n) (n)

// Macro to build up ALUOUT field in CFG0.
#define SLI_MVP_ALUOUT(n) ((n) << _MVP_INSTRCFG0_ALUOUTREGID_SHIFT)

// Macro to build up ALUIN field in CFG0. The SLI_MVP_ALU_* macros should
// be used instead when building up the ALU configuration when no flags are used.
// a - 0=ALUIN0, 1=ALUIN1, 2=ALUIN2
// r - 0-7=R0-R7
// f - flags, combination of any of these:
//   SLI_MVP_ALUIN_REALZERO
//   SLI_MVP_ALUIN_REALNEGATE
//   SLI_MVP_ALUIN_IMAGZERO
//   SLI_MVP_ALUIN_IMAGNEGATE
#define SLI_MVP_ALUIN(a, r, f) ((((f) << 4) | (r)) << (8 * (a)))

// First argument to ALU operation. ALU Input X == ALUIN0.
#define SLI_MVP_ALU_X(reg) SLI_MVP_ALUIN(0, reg, 0)

// Second argument to ALU operation. ALU Input Y == ALUIN1.
#define SLI_MVP_ALU_Y(reg) SLI_MVP_ALUIN(1, reg, 0)

// Third argument to ALU operation. ALU Input A == ALUIN2.
#define SLI_MVP_ALU_A(reg) SLI_MVP_ALUIN(2, reg, 0)

// Used to specify the output register. ALU Output Z == ALUOUT.
#define SLI_MVP_ALU_Z(reg) SLI_MVP_ALUOUT(reg)

// Macro to build REGLOAD/REGSTORE field in CFG1.
// SLI_MVP_LOAD() or SLI_MVP_STORE() should be used when building instructions.
#define SLI_MVP_STREAM(s, r, a, i) ((((i) << 7) | ((a) << 4) | 0x8 | (r)) << ((s) * 10))

// Specify use of Load channel 0 or 1.
// Example: SLI_MVP_LOAD(0, SLI_MVP_R1, SLI_MVP_ARRAY(0), SLI_MVP_INCRDIM0)
#define SLI_MVP_LOAD(n, r, a, i)  SLI_MVP_STREAM(n, r, a, i)

// Used when storing a register as part of an instruction.
// Example: SLI_MVP_STORE(SLI_MVP_R3, SLI_MVP_ARRAY(2), SLI_MVP_INCRDIM0)
#define SLI_MVP_STORE(r, a, i)    SLI_MVP_STREAM(SLI_MVP_REGSTORE, r, a, i)

// Define for MVP operation used in instructions.
#define SLI_MVP_OP(x) (_MVP_INSTRCFG2_ALUOP_ ## x)

// Loop Increment macro.
#define SLI_MVP_LOOP_INCRDIM(array, dim) ((dim) << (4 * (array)))

/**
 * ALU Registers are always represented as a complex float16_t type.
 * This structure is used to allow a program to assign value to either
 * the real or imaginary part of the ALU register.
 */
typedef struct {
  struct {
    float16_t real;
    float16_t imag;
  } value;
} sli_mvp_alu_bitfield_t;

