espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/driver/mvp/inc/sl_mvp.h
typedef struct {
  union {
    uint32_t REGSTATE; ///< ALU Rn Register.
    sli_mvp_alu_bitfield_t reg;
  };
} sli_mvp_alu_reg_t;

typedef struct
{
  uint32_t            ADDRCFG;  ///< Array Base Address
  union {
    uint32_t          DIM0CFG;  ///< Dimension 0 Configuration
    struct {
      uint32_t size       : 10;
      uint32_t            : 2;
      uint32_t basetype   : 2;
      uint32_t complex    : 1;
      uint32_t            : 1;
      uint32_t stride     : 12;
      uint32_t            : 4;
    } dim0cfg;
  };
  union {
    uint32_t          DIM1CFG;  ///< Dimension 1 Configuration
    struct {
      uint32_t size       : 10;
      uint32_t            : 6;
      uint32_t stride     : 12;
      uint32_t            : 4;
    } dim1cfg;
  };
  union {
    uint32_t          DIM2CFG;  ///< Dimension 2 Configuration
    struct {
      uint32_t size       : 10;
      uint32_t            : 6;
      uint32_t stride     : 12;
      uint32_t            : 4;
    } dim2cfg;
  };
} sli_mvp_array_reg_t;

typedef struct
{
  union {
    uint32_t          CFG;      ///< Loop Configuration
    struct {
      uint32_t numiters       : 10;
      uint32_t                : 2;
      uint32_t array0incrdim0 : 1;
      uint32_t array0incrdim1 : 1;
      uint32_t array0incrdim2 : 1;
      uint32_t                : 1;
      uint32_t array1incrdim0 : 1;
      uint32_t array1incrdim1 : 1;
      uint32_t array1incrdim2 : 1;
      uint32_t                : 1;
      uint32_t array2incrdim0 : 1;
      uint32_t array2incrdim1 : 1;
      uint32_t array2incrdim2 : 1;
      uint32_t                : 1;
      uint32_t array3incrdim0 : 1;
      uint32_t array3incrdim1 : 1;
      uint32_t array3incrdim2 : 1;
      uint32_t                : 1;
      uint32_t array4incrdim0 : 1;
      uint32_t array4incrdim1 : 1;
      uint32_t array4incrdim2 : 1;
      uint32_t                : 1;
    } cfg;
  };
  union {
    uint32_t          RST;      ///< Loop Reset
    struct {
      uint32_t                 : 12;
      uint32_t array0resetdim0 : 1;
      uint32_t array0resetdim1 : 1;
      uint32_t array0resetdim2 : 1;
      uint32_t                 : 1;
      uint32_t array1resetdim0 : 1;
      uint32_t array1resetdim1 : 1;
      uint32_t array1resetdim2 : 1;
      uint32_t                 : 1;
      uint32_t array2resetdim0 : 1;
      uint32_t array2resetdim1 : 1;
      uint32_t array2resetdim2 : 1;
      uint32_t                 : 1;
      uint32_t array3resetdim0 : 1;
      uint32_t array3resetdim1 : 1;
      uint32_t array3resetdim2 : 1;
      uint32_t                 : 1;
      uint32_t array4resetdim0 : 1;
      uint32_t array4resetdim1 : 1;
      uint32_t array4resetdim2 : 1;
      uint32_t                 : 1;
    } rst;
  };
} sli_mvp_loop_reg_t;

typedef struct {
  union {
    uint32_t          CFG0;      ///< Instruction Configuration Word 0.
    struct {
      uint32_t aluin0regid      : 3;
      uint32_t                  : 1;
      uint32_t aluin0realzero   : 1;
      uint32_t aluin0realnegate : 1;
      uint32_t aluin0imagzero   : 1;
      uint32_t aluin0imagnegate : 1;
      uint32_t aluin1regid      : 3;
      uint32_t                  : 1;
      uint32_t aluin1realzero   : 1;
      uint32_t aluin1realnegate : 1;
      uint32_t aluin1imagzero   : 1;
      uint32_t aluin1imagnegate : 1;
      uint32_t aluin2regid      : 3;
      uint32_t                  : 1;
      uint32_t aluin2realzero   : 1;
      uint32_t aluin2realnegate : 1;
      uint32_t aluin2imagzero   : 1;
      uint32_t aluin2imagnegate : 1;
      uint32_t                  : 4;
      uint32_t aluoutregid      : 3;
      uint32_t                  : 1;
    } cfg0;
  };
  union {
    uint32_t          CFG1;      ///< Instruction Configuration Word 1.
    struct {
      uint32_t istream0regid         : 3;
      uint32_t istream0load          : 1;
      uint32_t istream0arrayid       : 3;
      uint32_t istream0arrayincrdim0 : 1;
      uint32_t istream0arrayincrdim1 : 1;
      uint32_t istream0arrayincrdim2 : 1;
      uint32_t istream1regid         : 3;
      uint32_t istream1load          : 1;
      uint32_t istream1arrayid       : 3;
      uint32_t istream1arrayincrdim0 : 1;
      uint32_t istream1arrayincrdim1 : 1;
      uint32_t istream1arrayincrdim2 : 1;
      uint32_t ostreamregid          : 3;
      uint32_t ostreamstore          : 1;
      uint32_t ostreamarrayid        : 3;
      uint32_t ostreamarrayincrdim0  : 1;
      uint32_t ostreamarrayincrdim1  : 1;
      uint32_t ostreamarrayincrdim2  : 1;
      uint32_t                       : 2;
    } cfg1;
  };
  union {
    uint32_t          CFG2;      ///< Instruction Configuration Word 2.
    struct {
      uint32_t loop0begin : 1;
      uint32_t loop0end   : 1;
      uint32_t loop1begin : 1;
      uint32_t loop1end   : 1;
      uint32_t loop2begin : 1;
      uint32_t loop2end   : 1;
      uint32_t loop3begin : 1;
      uint32_t loop3end   : 1;
      uint32_t loop4begin : 1;
      uint32_t loop4end   : 1;
      uint32_t loop5begin : 1;
      uint32_t loop5end   : 1;
      uint32_t loop6begin : 1;
      uint32_t loop6end   : 1;
      uint32_t loop7begin : 1;
      uint32_t loop7end   : 1;
      uint32_t            : 4;
      uint32_t aluop      : 9;
      uint32_t            : 2;
      uint32_t endprog    : 1;
    } cfg2;
  };
} sli_mvp_instr_reg_t;

/**
 * Represents a single MVP program that can be loaded onto the hardware. A full
 * algorithm can potentially be represented by a number of different program
 * structures.
 */
typedef struct {
  sli_mvp_alu_reg_t ALU[8U];
  sli_mvp_array_reg_t ARRAY[5U];
  sli_mvp_loop_reg_t LOOP[8U];
  sli_mvp_instr_reg_t INSTR[8U];
  uint32_t CMD;
} sli_mvp_program_t;

/**
 * Type used when configuring performance counters.
 */
typedef enum {
  SLI_MVP_PERFCNT_CYCLES = 0,       ///< Count MVP cycles
  SLI_MVP_PERFCNT_INSTRUCTIONS = 1, ///< Count MVP instructions
  SLI_MVP_PERFCNT_STALL = 2         ///< Count number of stalls
} sli_mvp_perfcnt_t;

typedef enum {
  SLI_MVP_DATATYPE_UINT8            = 0x0,
  SLI_MVP_DATATYPE_INT8             = 0x1,
  SLI_MVP_DATATYPE_BINARY16         = 0x2,
  SLI_MVP_DATATYPE_COMPLEX_UINT8    = 0x4,
  SLI_MVP_DATATYPE_COMPLEX_INT8     = 0x5,
  SLI_MVP_DATATYPE_COMPLEX_BINARY16 = 0x6
} sli_mvp_datatype_t;

/**
 * MVP configuration parameters.
 */
typedef struct {
  bool use_dma;
  unsigned dma_ch;
} sli_mvp_config_t;

/**
 * Context for using the MVP program builder helper functions.
 */
typedef struct {
  sli_mvp_program_t program[2];   ///< Two MVP program buffers.
  uint32_t loop_begin_end[8];     ///< Storage for instruction loop begin/end bits.
  uint32_t loop_stack[8];         ///< Stack for keeping track of loop nesting level.
  sli_mvp_program_t *p;           ///< Pointer to active MVP program buffer.
  int prog_index;                 ///< Index used to select one of two possible MVP program buffers.
  int last_loop;                  ///< Loop counter.
  int last_instr;                 ///< Instruction counter.
  int loop_level;                 ///< Loop nesting level.
} sli_mvp_program_context_t;

/**
 * @brief
 *   Initialize the mvp hardware.
 *
 * @details
 *   This function must be called once before any of the other functions are
 *   used. This function will configure the MVP hardware based on the content
 *   of the sl_mvp_config.h file.
 *
 * @return
 *   SL_STATUS_OK on success, other value on failure.
 */
sl_status_t sli_mvp_init(void);

/**
 * @brief
 *   De-Initialize the mvp hardware.
 *
 * @details
 *   This function can be called when the MVP hardware is no longer being used.
 *
 * @return
 *   SL_STATUS_OK on success, other value on failure.
 */
sl_status_t sli_mvp_deinit(void);

/**
 * @brief
 *   Configure the operation of the MVP driver.
 *
 * @details
 *   This function can be used to reconfigure the MVP driver behavior after
 *   sli_mvp_init is called. This function can be used to switch between using
 *   DMA and CPU to load programs at runtime.
 *
 * @return
 *   SL_STATUS_OK on success, other value on failure.
 */
sl_status_t sli_mvp_config(sli_mvp_config_t *config);

/**
 * @brief
 *   Execute a single program on the MVP hardware.
 *
 * @details
 *   Used to schedule a program for execution.
 *
 * @param[in] program
 *   The program to run on the MVP hardware.
 *
 * @param[in] wait
 *   If true then the function will wait for the program to complete before
 *   returning to the caller. If false then the function will return to the
 *   caller before the program is completed.
 *
 * @return
 *   SL_STATUS_OK on success, other value on failure.
 */
sl_status_t sli_mvp_execute(sli_mvp_program_t *program, bool wait);


/**
 * @brief
 *   Wait for all the mvp program to complete.
 */
void sli_mvp_wait_for_completion(void);

// Functions for setting register value in an MVP program
void sli_mvp_prog_set_reg_s8(sli_mvp_program_t *prog, uint8_t reg, int8_t value);
void sli_mvp_prog_set_reg_s8c(sli_mvp_program_t *prog, uint8_t reg, int8_t real, int8_t imag);
void sli_mvp_prog_set_reg_s16(sli_mvp_program_t *prog, uint8_t reg, int16_t value);
void sli_mvp_prog_set_reg_s16c(sli_mvp_program_t *prog, uint8_t reg, int16_t real, int16_t imag);
void sli_mvp_prog_set_reg_s32(sli_mvp_program_t *prog, uint8_t reg, int32_t value);
void sli_mvp_prog_set_reg_s32c(sli_mvp_program_t *prog, uint8_t reg, int32_t real, int32_t imag);
void sli_mvp_prog_set_reg_f16(sli_mvp_program_t *prog, uint8_t reg, float16_t value);
void sli_mvp_prog_set_reg_f16c(sli_mvp_program_t *prog, uint8_t reg, float16_t real, float16_t imag);
void sli_mvp_prog_set_reg_f32(sli_mvp_program_t *prog, uint8_t reg, float value);
void sli_mvp_prog_set_reg_f32c(sli_mvp_program_t *prog, uint8_t reg, float real, float imag);

/**
 * @brief
 *   Configure a specific array in a program, with possibility to specify strides.
 *
 * @param[in] prog  The program to configure.
 * @param[in] index Array index. Values in the range 0-4.
 * @param[in] addr  Base address of the array.
 * @param[in] datatype Datatype of each array element.
 * @param[in] vecs Number of vectors (DIM0).
 * @param[in] rows Number of rows (DIM1).
 * @param[in] cols Number of columns (DIM2).
 * @param[in] vecstride Number of elements to advance when moving to the next vector (can be negative).
 * @param[in] rowstride Number of elements to advance when moving to the next row (can be negative).
 * @param[in] colstride Number of elements to advance when moving to the next column (can be negative).
 */
void sli_mvp_prog_set_array_full(sli_mvp_program_t *prog,
                                 uint8_t index,
                                 void *addr,
                                 sli_mvp_datatype_t type,
                                 unsigned short vecs,
                                 unsigned short rows,
                                 unsigned short cols,
                                 int vecstride,
                                 int rowstride,
                                 int colstride);

/**
 * @brief
 *   Configure a specific array in a program.
 *
 * @note
 *   The resulting memory ordering will be "NCHW" i.e. "vector major".
 *   This aligns with the memory ordering of a C-language 3D array.
 *
 * @param[in] prog  The program to configure.
 * @param[in] index Array index. Values in the range 0-4
 * @param[in] addr  Base address of the array.
 * @param[in] datatype Datatype of each array element.
 * @param[in] vecs Number of vectors (DIM0, major dimension).
 * @param[in] rows Number of rows (DIM1).
 * @param[in] cols Number of columns (DIM2, minor dimension).
 */
void sli_mvp_prog_set_array(sli_mvp_program_t *prog,
                            uint8_t index,
                            void *addr,
                            sli_mvp_datatype_t type,
                            unsigned short vecs,
                            unsigned short rows,
                            unsigned short cols);

/**
 * @brief
 *   Configure a specific vector in a program.
 *
 * @param[in] prog  The program to configure.
 * @param[in] index index. Values in the range 0-4
 * @param[in] addr  Base address of the vector.
 * @param[in] datatype Datatype of each vector element.
 * @param[in] len Number of elements in vector (DIM2).
 */
void sli_mvp_prog_set_vector(sli_mvp_program_t *prog,
                             uint8_t index,
                             void *addr,
                             sli_mvp_datatype_t type,
                             unsigned short len);

/**
 * @brief
 *   Configure a specific 2D matrix in a program.
 *
 * @note
 *   The resulting memory ordering will be "row major".
 *
 * @param[in] prog  The program to configure.
 * @param[in] index index. Values in the range 0-4
 * @param[in] addr  Base address of the matrix.
 * @param[in] datatype Datatype of each matrix element.
 * @param[in] rows Number of rows (DIM1, major dimension).
 * @param[in] cols Number of columns (DIM2, minor dimension).
 */
void sli_mvp_prog_set_matrix(sli_mvp_program_t *prog,
                             uint8_t index,
                             void *addr,
                             sli_mvp_datatype_t type,
                             unsigned short rows,
                             unsigned short cols);

/**
 * @brief
 *   Configure a specific instruction in a program.
 *
 * @param[in] prog  The program to configure.
 * @param[in] index Instruction index. Values in the range 0-7
 * @param[in] opcode Operation to perform.
 * @param[in] alu_cfg  ALU configuration specifying input/output registers to use.
 * @param[in] load_cfg Load configuration, specifying 0-2 load streams to use.
 * @param[in] store_cfg Store configuration, specifying 0-1 store stream to use.
 * @param[in] end True if this is the last instruction of the program, false otherwise.
 */
void sli_mvp_prog_set_instr(sli_mvp_program_t *prog,
                            uint8_t index,
                            uint32_t opcode,
                            uint32_t alu_cfg,
                            uint32_t load_cfg,
                            uint32_t store_cfg,
                            bool end);

/**
 * @brief
 *   Configure a specific loop in a program.
 *
 * @param[in] prog  The program to configure.
 * @param[in] index Loop index. Value in the range 0-7.
 * @param[in] count Number of iterations. Value in the range 1-1024.
 * @param[in] istart Start instruction of this loop.
 * @param[in] iend End instruction of this loop.
 * @param[in] incrarray Optional array increment configuration.
 */
void sli_mvp_prog_set_loop(sli_mvp_program_t *prog,
                           uint8_t index,
                           unsigned short count,
                           uint8_t istart,
                           uint8_t iend,
                           uint32_t incrarray);

/**
 * @brief
 *   Configure one of the performance counters.
 *
 * @details
 *   Each of the performance counters can track different events. What event to count
 *   is configurable using the type parameter.
 *
 * @param[in] id
 *   The id of the performance counter to configure.
 *
 * @param[in] type
 *   Type of event to count.
 */
void sli_mvp_perfcnt_conf(unsigned id, sli_mvp_perfcnt_t type);

/**
 * @brief
 *   Reset all performance counters.
 */
void sli_mvp_perfcnt_reset_all(void);

/**
 * @brief
 *   Fetch the current aggregated value of a performance counter.
 *
 * @param[in] id
 *   The id of the performance counter to configure.
 *
 * @return
 *   Performance counter value.
 */
uint32_t sli_mvp_perfcnt_get(unsigned id);

/**
 * @brief
 *   Reset program count counter.
 */
void sli_mvp_progcnt_reset(void);

/**
 * @brief
 *   Fetch the current aggregated value of the program count counter.
 *
 * @return
 *   Program count counter value.
 */
uint32_t sli_mvp_progcnt_get(void);

/**
 * @brief
 *  Start a MVP program loop.
 *
 * @note
 *   This function is part of the MVP program builder (pb) convenience API.
 *
 * @param[in] p Pointer to MVP program context.
 * @param[in] iterations Loop count.
 * @param[out] status Returns SL_STATUS_INVALID_PARAMETER when loop count is exhausted.
 *             status is only updated when this error occur.
 */
void sli_mvp_pb_begin_loop(sli_mvp_program_context_t *p, int iterations, sl_status_t *status);

/**
 * @brief
 *  Begin a MVP program, will initialize part of the program context.
 *  Must be called once for each MVP program, and prior to any loop, compute
 *  or execute functions.
 *
 * @note
 *   This function is part of the MVP program builder (pb) convenience API.
 *
 * @param[in] p Pointer to MVP program context.
 */
void sli_mvp_pb_begin_program(sli_mvp_program_context_t *p);

/**
 * @brief
 *  Insert a MVP instruction in the program.
 *
 * @note
 *   This function is part of the MVP program builder (pb) convenience API.
 *
 * @param[in] p Pointer to MVP program context.
 * @param[in] opcode Instruction opcode.
 * @param[in] alu_cfg Instruction ALU configuration.
 * @param[in] load_cfg Instruction load configuration.
 * @param[in] store_cfg Instruction store configuration.
 * @param[out] status Returns SL_STATUS_INVALID_PARAMETER when instruction count is exhausted.
 *             status is only updated when this error occur.
 */
void sli_mvp_pb_compute(sli_mvp_program_context_t *p, uint32_t opcode, uint32_t alu_cfg, uint32_t load_cfg, uint32_t store_cfg, sl_status_t *status);

/**
 * @brief
 *   Configure a specific 3D array in a program.
 *
 * @param[in] prog  The program to configure.
 * @param[in] index Array index. Values in the range 0-4.
 * @param[in] addr  Base address of the array.
 * @param[in] datatype Datatype of each array element.
 * @param[in] vecs Number of vectors (DIM0).
 * @param[in] rows Number of rows (DIM1).
 * @param[in] cols Number of columns (DIM2).
 * @param[in] vecstride Number of elements to advance when moving to the next vector (can be negative).
 * @param[in] rowstride Number of elements to advance when moving to the next row (can be negative).
 * @param[in] colstride Number of elements to advance when moving to the next column (can be negative).
 * @param[out] status Returns SL_STATUS_INVALID_PARAMETER if an invalid array
 *             index is specified. Returns SL_STATUS_INVALID_RANGE if invalid
 *             array size.
 *             status is only updated when these errors occur.
 */
void sli_mvp_pb_config_array_full(sli_mvp_program_t *prog,
                                  uint8_t index,
                                  void *addr,
                                  sli_mvp_datatype_t type,
                                  unsigned short vecs,
                                  unsigned short rows,
                                  unsigned short cols,
                                  int vecstride,
                                  int rowstride,
                                  int colstride,
                                  sl_status_t *status);

/**
 * @brief
 *   Configure a 3D MVP array in a program in NHWC or "row major" style.
 *
 * @note
 *   NHWC: N = batch, H = height, W = width, C = channel.
 *   NHWC memory ordering is "row major" within each batch, and is the default
 *   memory ordering used in TensorFlow.
 *   Since MVP handles only three dimensions, we silently treat n (batches)
 *   of nhwc as 1.
 *
 * @param[in] prog  The program to configure.
 * @param[in] index Array index. Values in the range 0-4
 * @param[in] addr  Base address of the array.
 * @param[in] datatype Datatype of each array element.
 * @param[in] h  Matrix height (rows, DIM1, major dimension).
 * @param[in] w  Matrix width (cols, DIM2).
 * @param[in] c  Matrix depth (vecs or channels, DIM0, minor dimension).
 * @param[out] status Returns SL_STATUS_INVALID_PARAMETER if an invalid array
 *             index is specified. Returns SL_STATUS_INVALID_RANGE if invalid
 *             array size.
 *             status is only updated when these errors occur.
 */
void sli_mvp_pb_config_array_nhwc(sli_mvp_program_t *prog,
                                  uint8_t index,
                                  void *addr,
                                  sli_mvp_datatype_t type,
                                  unsigned short h,
                                  unsigned short w,
                                  unsigned short c,
                                  sl_status_t *status);

/**
 * @brief
 *   Configure a specific 2D matrix in a program in "row major" style.
 *
 * @param[in] prog  The program to configure.
 * @param[in] index index. Values in the range 0-4
 * @param[in] addr  Base address of the matrix.
 * @param[in] datatype Datatype of each matrix element.
 * @param[in] rows Number of rows (DIM1, major dimension).
 * @param[in] cols Number of columns (DIM2, minor dimension).
 * @param[out] status Returns SL_STATUS_INVALID_PARAMETER if an invalid array
 *             index is specified. Returns SL_STATUS_INVALID_RANGE if invalid
 *             matrix size.
 *             status is only updated when these errors occur.
 */
void sli_mvp_pb_config_matrix(sli_mvp_program_t *prog,
                              uint8_t index,
                              void *addr,
                              sli_mvp_datatype_t type,
                              unsigned short rows,
                              unsigned short cols,
                              sl_status_t *status);

/**
 * @brief
 *   Configure a specific vector in a program.
 *
 * @param[in] prog  The program to configure.
 * @param[in] index index. Values in the range 0-4
 * @param[in] addr  Base address of the vector.
 * @param[in] datatype Datatype of each vector element.
 * @param[in] len Number of elements in vector (DIM2).
 * @param[out] status Returns SL_STATUS_INVALID_PARAMETER if an invalid array
 *             index is specified. Returns SL_STATUS_INVALID_RANGE if invalid
 *             vector size.
 *             status is only updated when these errors occur.
 */
void sli_mvp_pb_config_vector(sli_mvp_program_t *prog,
                              uint8_t index,
                              void *addr,
                              sli_mvp_datatype_t type,
                              unsigned short len,
                              sl_status_t *status);

/**
 * @brief
 *  End a MVP program loop.
 *
 * @note
 *   This function is part of the MVP program builder (pb) convenience API.
 *
 * @param[in] p Pointer to MVP program context.
 */
void sli_mvp_pb_end_loop(sli_mvp_program_context_t *p);

/**
 * @brief
 *  Execute a MVP program.
 *
 * @note
 *   This function is part of the MVP program builder (pb) convenience API.
 *
 * @param[in] p Pointer to MVP program context.
 */
void sli_mvp_pb_execute_program(sli_mvp_program_context_t *p);

/**
 * @brief
 *  Initialize a MVP program context. Must be called once before a group of
 *  MVP programs are executed.
 *
 * @note
 *   This function is part of the MVP program builder (pb) convenience API.
 *
 * @param[in] p Pointer to MVP program context.
 */
void sli_mvp_pb_init_program(sli_mvp_program_context_t *p);

/**
 * @brief
 *  Set array dimension reset in previous loop iterator.
 *  When used after a call to @ref sli_mvp_end_loop(), the index will be reset
 *  on loop exit.
 *
 * @note
 *   This function is part of the MVP program builder (pb) convenience API.
 *
 * @param[in] p Pointer to MVP program context.
 * @param[in] array_index Index of array.
 * @param[in] dimension Dimension to reset.
 */
void sli_mvp_pb_postloop_incr_dim(sli_mvp_program_context_t *p, uint8_t array_index, uint8_t dimension);

/**
 * @brief
 *  Set array dimension index incrementer in previous loop iterator.
 *  When used after a call to @ref sli_mvp_end_loop(), the index will increment
 *  on loop exit.
 *
 * @note
 *   This function is part of the MVP program builder (pb) convenience API.
 *
 * @param[in] p Pointer to MVP program context.
 * @param[in] array_index Index of array.
 * @param[in] dimension Dimension to increment.
 */
void sli_mvp_pb_postloop_reset_dim(sli_mvp_program_context_t *p, uint8_t array_index, uint8_t dimension);

/** @} (end addtogroup mvp) */
/// @endcond

#ifdef __cplusplus
}
#endif

#endif // SL_MVP_H
